<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<link rel="stylesheet" type="text/css" href="../../main.css">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
</script>
<script type="text/javascript">
</script>
<title>Strawberry Panic! Hanabi (part 9 of 9) (Shoujo-Ai Archive Fanfiction)</title>
</head>
<body>

<h1>Strawberry Panic! Hanabi (part 9 of 9)</h1>
<h2>a <a href="../strawberry/index.html">Strawberry Panic</a> 
fanfiction by <a href="../authors/cradlerobber.html">Cradlerobber Speedo-kun</a><br> </h2>
<a href="../strawberry/hanabi-ch8.html">Back to Part 8</a><pre>&acirc;&#128;&#156;You sound so surprised to see me.&acirc;&#128;&#157; Makoto stated, the smirk still firmly in place.

Chikaru regained her composure, smiling brightly, &acirc;&#128;&#156;Why, you never said you were returning!&acirc;&#128;&#157;

Her attitude had the proper affect, as Makoto now looked slightly annoyed, &acirc;&#128;&#156;Well, you 
mentioned missing me in every letter I got from you, so why are you so shocked?&acirc;&#128;&#157;

The smile remained in place, hiding the mild amusement Chikaru was feeling, &acirc;&#128;&#156;Well, I simply 
thought that studying at the St. Petersburg Academy of Music was a little more important 
than assuaging a friend, so I didn&acirc;&#128;&#153;t expect you to actually come back with so little 
reason.&acirc;&#128;&#157;

Makoto&acirc;&#128;&#153;s smirk had fully fallen into a scowl now, one met by Chikaru&acirc;&#128;&#153;s intentionally 
innocent smile. But she tossed her head slightly, her voice regaining its regular lilt of 
bravado, &acirc;&#128;&#156;Well, it isn&acirc;&#128;&#153;t as if I simply returned because of that; I&acirc;&#128;&#153;m concerned about my 
dear St. Spica&acirc;&#128;&brvbar; you told me all about the Etoile election in your letters, and I find it 
frankly disappointing that our former president couldn&acirc;&#128;&#153;t come up with a better option than a 
transfer and the bland Amane. But, then again, Toumori wasn&acirc;&#128;&#153;t exactly the most imaginative 
of people&acirc;&#128;&brvbar;&acirc;&#128;&#157;

Chikaru cocked her head, &acirc;&#128;&#156;But the election is over now &acirc;&#128;&#147; you can&acirc;&#128;&#153;t do anything about it, 
unless you were planning on digging up some dirt on either Amane or Hikari.&acirc;&#128;&#157; She smiled 
maddeningly again, &acirc;&#128;&#156;I didn&acirc;&#128;&#153;t know you&acirc;&#128;&#153;d fallen to such depths, Makoto! But it has been a 
while since I&acirc;&#128;&#153;ve seen you.&acirc;&#128;&#157;

Makoto looked mildly annoyed, but avoided verbalizing that fact, &acirc;&#128;&#156;Well, I couldn&acirc;&#128;&#153;t return 
mid-term, so I had to wait. And I&acirc;&#128;&#153;m back now to ensure that our reputation doesn&acirc;&#128;&#153;t get 
further sullied than I&acirc;&#128;&#153;m sure it already has. And, of course, they&acirc;&#128;&#153;re only Etoile for the 
year&acirc;&#128;&brvbar;&acirc;&#128;&#157;

Makoto&acirc;&#128;&#153;s eyes wandered, and it seemed that she only now noticed the presence of Fuyuko, 
whose own eyes were fixed elsewhere, hazily indicating her lack of attention to the subject 
at hand. Makoto looked to Chikaru quizzically, as the girl with the pale blue hair was in 
the le Rim uniform.

&acirc;&#128;&#156;Oh, pardon my rudeness,&acirc;&#128;&#157; Chikaru said, quickly recovering from her gaffe, &acirc;&#128;&#156;This is Yukizawa 
Fuyuko &acirc;&#128;&#147; she&acirc;&#128;&#153;s a transfer to St. le Rim this year, so I&acirc;&#128;&#153;ve been showing her the campus.&acirc;&#128;&#157; 
Chikaru turned to Fuyuko, &acirc;&#128;&#156;And this is Kusanagi Makoto &acirc;&#128;&#147; she goes to Spica, but she was 
studying music abroad in Russia last year.&acirc;&#128;&#157;

It was at this that Makoto launched into her debonair mode, one which always came off 
slightly comically due to her lack of height. She took Fuyuko&acirc;&#128;&#153;s hand, kissed it, and smiled 
devilishly, &acirc;&#128;&#156;It&acirc;&#128;&#153;s a pleasure to meet you.&acirc;&#128;&#157;

Fuyuko looked slightly flustered, &acirc;&#128;&#156;Uh, and the same.&acirc;&#128;&#157; But Chikaru noticed a slight hint of 
irritation to her voice, and she smiled inwardly &acirc;&#128;&#147; Makoto wasn&acirc;&#128;&#153;t quite Shizuma when it came 
to the fine art of wooing a would-be fan.

Fuyuko had stiffened her shoulders now, further adding to the impression Chikaru was getting 
of annoyance, and spoke of her own accord for once, &acirc;&#128;&#156;I must be going &acirc;&#128;&#147; I would like to iron 
my uniform and freshen it up for classes to-morrow. Thank you for your help.&acirc;&#128;&#157; She gave a 
stiff bow before turning away. She made her way up the stairs, and vanished around the 
corner.

&acirc;&#128;&#156;I don&acirc;&#128;&#153;t think you quite impressed her.&acirc;&#128;&#157;

Makoto shrugged, &acirc;&#128;&#156;Well, she&acirc;&#128;&#153;s one of your degenerates &acirc;&#128;&#147; I just have to focus on my own 
flock.&acirc;&#128;&#157;

&acirc;&#128;&#156;So you&acirc;&#128;&#153;re already making plans for Etoile? Even Shion never started that early!&acirc;&#128;&#157;

&acirc;&#128;&#156;It&acirc;&#128;&#153;s just something to keep in mind.&acirc;&#128;&#157; Makoto said nonchalantly.

Chikaru grinned, &acirc;&#128;&#156;My, but who on earth would you run with? You&acirc;&#128;&#153;ve been away for a year, your 
fans have evaporated! And, sadly,&acirc;&#128;&#157; She put a hand to her heart, throwing on a melodramatic 
look of woe, &acirc;&#128;&#156;your dearest friend is but a lowly le Rim student! It shall never be so!&acirc;&#128;&#157;

Makoto looked annoyed again, &acirc;&#128;&#156;No one even knows I&acirc;&#128;&#153;m back yet; this hall would be stuffed 
otherwise.&acirc;&#128;&#157;

&acirc;&#128;&#156;Oh, of course, of course&acirc;&#128;&brvbar;&acirc;&#128;&#157;

It was fun for Chikaru to pick at Makoto. Makoto had been a classmate of hers back in 
elementary school, and the two had become fast friends in kindergarten. Chikaru had always 
played the role of the instigator, prodding at her ambitious friend whenever the chance 
presented itself. Makoto had teased her when she announced her intention to attend le Rim is 
she had to go near Astraea at all, and she had returned the favor when Makoto rhapsodied 
about the ever-so-wonderful Spica. Neither of them would ever have made an even half decent 
Miator student; Chikaru suspected that something such as marriage would never be in the 
cards for Makoto, no matter how much that would grate on her family.

Marriage. It seemed a continuing theme for all of them, all the rich young women dashing 
around Astraea, even though people only talked about the Miator girls. Marriage and heirs 
and lace and money. Did anyone ever mentioned mistresses? But, in these cases, not for the 
husbands! Although they probably had one tucked away, too, feeling smug even as their wives 
were busily hoodwinking them without batting an eye.

Ah, but there were a few students whom the issue of marriage would never touch, although 
they were few and far between &acirc;&#128;&#147; Shizuma had been one, and maybe the current Etoile did too. 
Kaname and Momomi were definitely on that list, along with a few of the financial 
scholarship girls who simply had more freedom by dint of their family&acirc;&#128;&#153;s lack of &acirc;&#128;&#156;prestige&acirc;&#128;&#157;.

And, yes, Makoto was definitely on that list, too, although Chikaru figured this had more to 
do with Makoto&acirc;&#128;&#153;s simple penchant for wooing, as opposed to any desire to emplace herself 
within a homosexual relationship. Makoto enjoyed attention, and she enjoyed getting it from 
a lot of people; it also wasn&acirc;&#128;&#153;t the false front that Shizuma employed following Kaori&acirc;&#128;&#153;s 
death. No, Makoto was doing a good job of setting herself up as a womanizer, although 
Chikaru had a feeling that she would&acirc;&#128;&#153;ve womanized men, too, were the setting coed.

Chikaru drew out of her thoughts, and gazed at Makoto. The pair had begun walking toward the 
study room, as Makoto had begun to move that way. She was now going full-speed in an 
impassioned monologue about the impeccable reputation of Spica, and how it was at risk of 
being irreparably marred if something was not done, for things had been set askew, and 
Spica&acirc;&#128;&#153;s image could not keep impressive forever if such things were allowed to continue. 
Chikaru merely smiled and nodded her head on occasion, not caring terribly much about the 
subject at hand. But it was funny to see Makoto get worked up about it.

As they drew near the study room, Chikaru interrupted Makoto, &acirc;&#128;&#156;Oh, Makoto, are you going to 
be going to dinner at the regular time tonight, or do you still have some unpacking to do?&acirc;&#128;&#157;

&acirc;&#128;&#156;No, I&acirc;&#128;&#153;m all done with that, why?&acirc;&#128;&#157;

&acirc;&#128;&#156;I have a few friends I&acirc;&#128;&#153;d like you to meet.&acirc;&#128;&#157; Chikaru said as she turned the handle on the 
door.

Makoto broke into a grin, her tirade forgotten, &quot;Of course!&quot;

After all, there was nothing Makoto enjoyed more than meeting potential new fans.
</pre>
<hr> 
 <p><a href="../strawberry/hanabi-index.html">Back to Strawberry Panic! Hanabi Index</a> -
<a href="../strawberry/index.html">Back to Strawberry Panic Shoujo-Ai Fanfiction</a></p>

</body>
</html>
