<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<link rel="stylesheet" type="text/css" href="../../main.css">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
</script>
<script type="text/javascript">
</script>
<title>Night Angels (part 29 of 32) (Shoujo-Ai Archive Fanfiction)</title>
</head>
<body>

<h1>Night Angels (part 29 of 32)</h1>
<h2>a <a href="../hellsing/index.html">Hellsing</a> 
fanfiction by <a href="../authors/ecoldiron.html">Elwin Blain Coldiron</a><br> </h2>
<a href="../hellsing/niteangel-ch28.html">Back to Part 28</a><pre>A FEW MINUTES PRIOR&acirc;&#128;&brvbar;

It was with a heavy sigh that the young man had proceeded down the stairs leading to the 
dungeon, a tray of food in hand. He had curly blonde hair with blue eyes; clearly not one 
who was an original member of the Wild Geese. However, the crucifix upon his collar did 
identify him as a chaplain, and he felt it his sacred duty to tend to the welfare of the 
incarcerated.

As he came to a set of guarded doors, he happened upon two guards. One of them &acirc;&#128;&#147; Alfie 
Henderson &acirc;&#128;&#147; looked upon the young man and asked, &acirc;&#128;&#156;I don&acirc;&#128;&#153;t recall seeing you at the 
orientation, Padre.&acirc;&#128;&#157;

&acirc;&#128;&#156;That&acirc;&#128;&#153;s alright,&acirc;&#128;&#157; the young man replied, as if he heard the question before. &acirc;&#128;&#156;I was here a 
week before you guys came. I&acirc;&#128;&#153;m here to feed the prisoner.&acirc;&#128;&#157;

&acirc;&#128;&#156;If you ask me,&acirc;&#128;&#157; Alfie&acirc;&#128;&#153;s companion grumbled, &acirc;&#128;&#156;I say let him starve! After what he did to 
Rally, he deserves it!&acirc;&#128;&#157;

&acirc;&#128;&#156;Now that&acirc;&#128;&#153;s not very kind,&acirc;&#128;&#157; the young man said.

&acirc;&#128;&#156;Maybe so&acirc;&#128;&brvbar; but Rally gave me a second chance for a good life and I like to return the 
compliment any way I can,&acirc;&#128;&#157; Alfie added, but later shrugged and said, &acirc;&#128;&#156;Okay, you can pass&acirc;&#128;&brvbar; 
uh&acirc;&#128;&brvbar; what&acirc;&#128;&#153;s your name, by the way, Padre?&acirc;&#128;&#157;

&acirc;&#128;&#156;It&acirc;&#128;&#153;s Honjo &acirc;&#128;&#147; Haruto Honjo,&acirc;&#128;&#157; the boy replied. &acirc;&#128;&#156;I&acirc;&#128;&#153;m the Wild Geese&acirc;&#128;&#153;s chaplain. Joined up 
after leaving the Japan Self Defense Force.&acirc;&#128;&#157;

&acirc;&#128;&#156;That&acirc;&#128;&#153;s odd&acirc;&#128;&brvbar; you don&acirc;&#128;&#153;t look Japanese,&acirc;&#128;&#157; Alfie said suspiciously.

&acirc;&#128;&#156;My father, who is a minister, was originally from Europe,&acirc;&#128;&#157; Haruto replied with relative 
ease. &acirc;&#128;&#156;He, along with my mother, thought it would be a good thing if he were to more able to 
identify with his congregation in Tokyo to take upon a Japanese name, so they had their 
surnames legally changed after a few years.&acirc;&#128;&#157;

Alfie just looked at Haruto a bit, then waived him on. &acirc;&#128;&#156;By the way, Padre,&acirc;&#128;&#157; he asked, &acirc;&#128;&#156;you 
don&acirc;&#128;&#153;t happen to have any qualms about working with vampires, do you? My friend Rally just 
happens to be one after all.&acirc;&#128;&#157;

Haruto just smiled as he walked through the door. &acirc;&#128;&#156;Oh don&acirc;&#128;&#153;t worry,&acirc;&#128;&#157; he said with a forced 
smile, &acirc;&#128;&#156;I have nothing of the sort.&acirc;&#128;&#157; Then after the door closed, he added in a low voice, 
&acirc;&#128;&#156;After all, I&acirc;&#128;&#153;ve see far worse than vampires back in Saito High School.&acirc;&#128;&#157;

Haruto then made his way to one of the cells in the dungeon &acirc;&#128;&#147; one that was the current 
holding cell of Vic, who had assaulted Irene &acirc;&#128;&#152;Rally&acirc;&#128;&#153; Vincent the night before with a wooden 
stake. Balancing the tray with his left hand, he managed to slip the key into the slot and 
turned it. As the door opened, he had a big smile on his face as he began, &acirc;&#128;&#156;Good evening. I 
hope you&acirc;&#128;&#153;re hungry, because&acirc;&#128;&brvbar;&acirc;&#128;&#157;

WHAM!!!

The tray Haruto was holding was kicked into his face, sending the young chaplain backwards 
into the corridor. Taking advantage, Vic rounded around the wall he hid against, out of his 
cell, and raced for the dungeon door.

Upon hearing the commotion, Alfie burst out the door. &acirc;&#128;&#156;Anything wrong, Padre? We heard some 
noise and&acirc;&#128;&brvbar; THE PRISONER&acirc;&#128;&#153;S ESCAPED! QUICK, SEAL-OFF THE&acirc;&#128;&brvbar;&acirc;&#128;&#157; But Alfie never got the chance to 
finish, on account of Vic uppercutting him in the jaw. Alfie&acirc;&#128;&#153;s partner, in the meantime, 
tried to pull the door shut, but Vic managed to jam his foot in before it could close. Then 
jerking the door open, he pulled the soldier in and rammed his head into the stone wall. 
Then grabbing the unfortunate man&acirc;&#128;&#153;s sidearm from its holster, he made his way down the 
corridor.

Once there, he was greeted by the closed door of the dungeon, which was on a key lock. &acirc;&#128;&#156;Hope 
they haven&acirc;&#128;&#153;t changed the combination yet!&acirc;&#128;&#157; Vic muttered to himself as he punched the code. 
Soon, a buzz showed that he was successful, and the door was opened. Taking care not to 
alert the other Geese, he managed to sneak outside, where he found a clump of bushes to 
hide.

Back inside the dungeon, Alfie managed to shake the cobwebs out of his head. &acirc;&#128;&#156;Oh crap,&acirc;&#128;&#157; he 
said to himself, &acirc;&#128;&#156;I hope Sir Integra doesn&acirc;&#128;&#153;t skin my hide for this!&acirc;&#128;&#157; Seeing that his partner 
was alright &acirc;&#128;&#147; by the way he was groping for the intercom handset &acirc;&#128;&#147; Alfie then turned his 
attention to Haruto, who was still sprawled on the ground, his face and uniform covered in 
spilled food. &acirc;&#128;&#156;Padre,&acirc;&#128;&#157; Alfie shouted out as he helped the young man up, &acirc;&#128;&#156;are you alright?&acirc;&#128;&#157;

Haruto was still dazed, if his glazed eyes were any indication. However, he was able to 
mutter in a low groan, &acirc;&#128;&#156;Oh&acirc;&#128;&brvbar; my&acirc;&#128;&brvbar; god!&acirc;&#128;&#157;

THE OFFICE OF SIR INTEGRA FAIRBROOK WINGATES HELLSING, AT THE SAME TIME&acirc;&#128;&brvbar;

Upon hearing Moria Hedgley screaming, both Rally and Bean Bandit burst into the room, Rally 
running through the door while Bean opened it first. Both vampire and courier were surprised 
at the sight of Moria, who was on her knees, her features looking more lupine by the second. 
Standing helplessly, Sir Integra, Walter C. Dolnez, Seras Victoria, Kenneth Hedgley and Sir 
Reginald Townstead all watched as the dusky vampire ran to the maid&acirc;&#128;&#153;s side. Strangely 
though, Alucard also appeared, the No-Life King standing at his master&acirc;&#128;&#153;s side &acirc;&#128;&#147; almost as if 
protecting her.

Somehow managing to look up, Moria&acirc;&#128;&#153;s eyes were tear-stained. &acirc;&#128;&#156;It&acirc;&#128;&#153;s&acirc;&#128;&brvbar; it&acirc;&#128;&#153;s no good!&acirc;&#128;&#157; she 
managed to say, words being difficult to form. &acirc;&#128;&#156;I can&acirc;&#128;&#153;t stop the transformation! I&acirc;&#128;&#153;m&acirc;&#128;&brvbar; I&acirc;&#128;&#153;m 
turning into a wolf!&acirc;&#128;&#157;

&acirc;&#128;&#156;Don&acirc;&#128;&#153;t say that, Moria!&acirc;&#128;&#157; Rally countered as she quickly knelt down and gripped Moria&acirc;&#128;&#153;s head 
with both hands. &acirc;&#128;&#156;You&acirc;&#128;&#153;re just panicking, that&acirc;&#128;&#153;s all! What I want you to do is to calm down 
and concentrated on reversing the transformation!&acirc;&#128;&#157;

&acirc;&#128;&#156;But Rally&acirc;&#128;&brvbar;&acirc;&#128;&#157;

&acirc;&#128;&#156;NO BUTS, MORIA!!!&acirc;&#128;&#157; Rally shot back, eyes locking into Moria&acirc;&#128;&#153;s. &acirc;&#128;&#156;NOW CALM DOWN AND 
CONCENTRATE!!! I&acirc;&#128;&#153;M NOT GOING TO LET YOU CHANGE INTO A WOLF WITHOUT YOUR SAY-SO!!!&acirc;&#128;&#157; Taken 
aback with her lover&acirc;&#128;&#153;s forcefulness, Moria somehow found the strength to make the attempt. 
Quickly, she steadied her breathing and closed her eyes, intently concentrating on reversing 
the transformation.

For a few seconds, it seemed that it wouldn&acirc;&#128;&#153;t be a success; Moria was still transforming, 
her clothes tearing as she did. But then there was a pause in the metamorphosis. Then 
slowly, but progressing rapidly, the process reversed itself as Moria&acirc;&#128;&#153;s features became more 
human by the second. It was a strain, but in less time than what was thought possible, the 
young maid was once again human-looking.

Trembling, Moria threw herself into Rally&acirc;&#128;&#153;s embrace as soon as it finished, tears streaming 
from her eyes. &acirc;&#128;&#156;Oh thank god,&acirc;&#128;&#157; she breathed, tightly clutching the dusky vampire, &acirc;&#128;&#156;that was 
too close! I might not have been able to do it if you haven&acirc;&#128;&#153;t forced the issue, my lovely!&acirc;&#128;&#157;

&acirc;&#128;&#156;Hey, think nothing about it, Moria,&acirc;&#128;&#157; Rally whispered, patting her shoulder. Seeing that the 
others were relaxing, she added, &acirc;&#128;&#156;By the way, I think they would like to know you&acirc;&#128;&#153;re 
alright.&acirc;&#128;&#157;

&acirc;&#128;&#156;Uh&acirc;&#128;&brvbar; yes.&acirc;&#128;&#157; Straightening her torn clothing, Moria got back to her feet as she approached her 
father. &acirc;&#128;&#156;I know you did warn me about the nights of the full moon being chaotic, but I guess 
I couldn&acirc;&#128;&#153;t be angry with you if this slipped your mind, Father.&acirc;&#128;&#157; She then hugged Kenneth, 
adding, &acirc;&#128;&#156;I&acirc;&#128;&#153;m sorry.&acirc;&#128;&#157;

&acirc;&#128;&#156;I think there was blame enough to share, Moria dear,&acirc;&#128;&#157; Kenneth gently said, returning the 
embrace. &acirc;&#128;&#156;Now dear, I want you to know that this was only the first attempt tonight. There 
will be others, so I want you to be better prepared for them.&acirc;&#128;&#157;

Moria nodded in agreement. However, she was distracted as she felt another transformation 
take hold. &acirc;&#128;&#156;No, I won&acirc;&#128;&#153;t let this happen again!&acirc;&#128;&#157; she whispered, and this time stopped and 
reversed the transformation before it could progress further. &acirc;&#128;&#156;Hmm&acirc;&#128;&brvbar; that was easier than I 
thought,&acirc;&#128;&#157; she said to herself.

Kenneth, however, looked surprised. &acirc;&#128;&#156;How odd,&acirc;&#128;&#157; he whispered to Sir Integra. &acirc;&#128;&#156;It took me the 
better part of seventy years to achieve the degree of control Moria has just exhibited! How 
is this possible?&acirc;&#128;&#157; The Hellsing leader could only shrug in confusion.

&acirc;&#128;&#156;Perhaps it is because of genetics that your daughter has achieved the success she has,&acirc;&#128;&#157; 
Alucard offered, smiling. &acirc;&#128;&#156;After all, you had at least 400 years of practice to do it.&acirc;&#128;&#157;

&acirc;&#128;&#156;In other words,&acirc;&#128;&#157; Sir Integra added, &acirc;&#128;&#156;you speculate that, because of this, Moria had 
inherited the degree of control she has now because of it. Interesting&acirc;&#128;&brvbar; but it remains to be 
seen how&acirc;&#128;&brvbar;&acirc;&#128;&#157; but then the intercom had interrupted her musings. Switching on the speaker, she 
said, &acirc;&#128;&#156;What is it? We are very busy right here.&acirc;&#128;&#157;

&acirc;&#128;&#156;Sir Integra,&acirc;&#128;&#157; Alfie called-out on the other end, &acirc;&#128;&#156;the prisoner we had locked-up has just 
escaped!&acirc;&#128;&#157;

&acirc;&#128;&#156;WHAT!?!&acirc;&#128;&#157; The furious look in Sir Integra&acirc;&#128;&#153;s ice-blue eyes said it all to those who heard her 
outburst.

&acirc;&#128;&#156;The chaplain went to feed him and got knocked-out as a result!&acirc;&#128;&#157; Alfie added. &acirc;&#128;&#156;He overcame 
myself and my partner, then fled outside! He&acirc;&#128;&#153;s also armed! We&acirc;&#128;&#153;ve ordered the perimeter guard 
to double their guard!&acirc;&#128;&#157;

&acirc;&#128;&#156;Very well,&acirc;&#128;&#157; Sir Integra replied briskly, &acirc;&#128;&#156;you do just that! We will aid you as soon as 
possible!&acirc;&#128;&#157; Switching off the intercom, she said to those gather, &acirc;&#128;&#156;Unbelievable as it sounds, 
it would appear that this Vic has made his escape!&acirc;&#128;&#157;

&acirc;&#128;&#156;Oh crap!&acirc;&#128;&#157; Rally growled, her orange red eyes glowing brightly. &acirc;&#128;&#156;Sir Integra, any chance the 
troops will catch this guy?&acirc;&#128;&#157;

The Hellsing leader looked tursly at her friend and replied, &acirc;&#128;&#156;They had better!&acirc;&#128;&#157; Then calming 
herself, she added, &acirc;&#128;&#156;Unfortunately, Vic does have the advantage of darkness on his side as 
well as his prior experiences, and the grounds have quite a bit of vegetation to offer 
concealment, so all he has to do is wait until an opening offers itself so he can make his 
way out of the grounds.&acirc;&#128;&#157; She then looked outside, &acirc;&#128;&#156;At least we do have the full moon on our 
side&acirc;&#128;&brvbar; but we cannot depend upon that to help us.&acirc;&#128;&#157;

Sir Integra then looked grimly at Rally and further added, &acirc;&#128;&#156;Rally, I am afraid we may have 
to depend upon you to prevent his escape. He has knowledge of this organization that might 
be of use to our enemies&acirc;&#128;&brvbar; so I will have to order you to, if you locate him&acirc;&#128;&brvbar; make sure he is 
unable to do so for all time!&acirc;&#128;&#157;

&acirc;&#128;&#156;In other words,&acirc;&#128;&#157; Rally said grimly, &acirc;&#128;&#156;you want me to kill him?&acirc;&#128;&#157; Sir Integra nodded. &acirc;&#128;&#156;Very 
well&acirc;&#128;&brvbar;&acirc;&#128;&#157; she added, smiling, &acirc;&#128;&#156;I&acirc;&#128;&#153;ll make sure he doesn&acirc;&#128;&#153;t live to see the sun rise, Sir 
Integra!&acirc;&#128;&#157; With that, she spun around and made her way out of the office.

&acirc;&#128;&#156;Rally, if I may?&acirc;&#128;&#157; Moria suddenly put-in, surprising the dusky vampire. After a brief pause 
to stop another transformation cycle, the maid said, &acirc;&#128;&#156;I wish to accompany you in hunting 
down that bastard.&acirc;&#128;&#157;

Rally blinked. &acirc;&#128;&#156;Are you certain, Moria?&acirc;&#128;&#157; she asked. &acirc;&#128;&#156;You&acirc;&#128;&#153;re still having to fight your 
transformations.&acirc;&#128;&#157;

&acirc;&#128;&#156;Well, I wouldn&acirc;&#128;&#153;t worry if I were you,&acirc;&#128;&#157; Moria replied. &acirc;&#128;&#156;In fact,&acirc;&#128;&#157; she added with a smile, &acirc;&#128;&#156;I 
think that I might turn this little problem of mine to our advantage. Just allow me to 
change out of these torn clothes and I&acirc;&#128;&#153;ll accompany you out.&acirc;&#128;&#157; Rally said nothing, but had a 
concerned look on her face as she allowed Moria to pass.

But as the two left the office, the remaining occupants looked at each other. &acirc;&#128;&#156;Mr. Hedgley,&acirc;&#128;&#157; 
Sir Integra said in a low voice, &acirc;&#128;&#156;you do not suppose that Moria plans to use her current 
circumstances to our advantage, do you?&acirc;&#128;&#157;

&acirc;&#128;&#156;I wouldn&acirc;&#128;&#153;t put-it past her to do it,&acirc;&#128;&#157; Kenneth added. &acirc;&#128;&#156;But if she does,&acirc;&#128;&#157; he further said as 
he exited the office, &acirc;&#128;&#156;I want to make sure she&acirc;&#128;&#153;s not alone at this.&acirc;&#128;&#157; He then excused himself 
from the office. &acirc;&#128;&#156;All the same, it&acirc;&#128;&#153;s best I see that she&acirc;&#128;&#153;s able to do this, so I better see 
myself out.&acirc;&#128;&#157; Integra didn&acirc;&#128;&#153;t say anything &acirc;&#128;&#147; realizing what he had in mind &acirc;&#128;&#147; but chose not to 
voice her opinion, instead nodding her approval.

XXX

It didn&acirc;&#128;&#153;t take long for Vic to find a patch of bushes across from the motor pool to hide in, 
but didn&acirc;&#128;&#153;t depend on that, so he made a quick sprint further away, making sure he didn&acirc;&#128;&#153;t 
call attention to himself. He was concerned about the full moon, though. &acirc;&#128;&#152;Dammit!&acirc;&#128;&#153; he 
thought to himself, &acirc;&#128;&#152;I&acirc;&#128;&#153;ve got to do better if I&acirc;&#128;&#153;m going to make the wall! Let&acirc;&#128;&#153;s see&acirc;&#128;&brvbar; there&acirc;&#128;&#153;s 
hardly anyone searching over there, so I&acirc;&#128;&#153;ll hide there for a while.&acirc;&#128;&#153;

Silently, but quick as a cat, Vic paced-out a path to another clump of bushes, which seemed 
to afford more cover than where he was. As soon as he made it, he flattened on the ground, 
making sure to regulate his breath. &acirc;&#128;&#152;I just hope that bitch Integra doesn&acirc;&#128;&#153;t send out her pet 
vampires against me&acirc;&#128;&brvbar; or I&acirc;&#128;&#153;m toast!&acirc;&#128;&#153;

&acirc;&#128;&#156;Oh my&acirc;&#128;&brvbar; it seems you&acirc;&#128;&#153;re in quite a spot, aren&acirc;&#128;&#153;t you?&acirc;&#128;&#157;

Nearly yelping, Vic jumped-up at the source of the voice, only to see Moria standing behind 
him. Seductively walking towards him, her generous curves visible in the moonlight, the maid 
added, smiling, &acirc;&#128;&#156;Don&acirc;&#128;&#153;t worry, I won&acirc;&#128;&#153;t reveal your location.&acirc;&#128;&#157;

A look of relief on his face, Vic silently made his way to the young woman. &acirc;&#128;&#156;Well, it&acirc;&#128;&#153;s 
apparent that you&acirc;&#128;&#153;ve changed your mind about me,&acirc;&#128;&#157; he said. &acirc;&#128;&#156;Look, I&acirc;&#128;&#153;m in a bit of trouble 
here. Do you happen to have any way to get me past the gate so I can get clear of this 
place?&acirc;&#128;&#157;

Moria cocked her head. &acirc;&#128;&#156;So&acirc;&#128;&brvbar; if I do what you wish, what do I get out of this?&acirc;&#128;&#157; she asked, 
fighting another transformation cycle while she still smiled.

&acirc;&#128;&#156;I never thought you&acirc;&#128;&#153;d ask.&acirc;&#128;&#157; Vic gently embraced Moria as he said, &acirc;&#128;&#156;How about this &acirc;&#128;&#147; you and 
I go into business as mercenaries together. Think about it &acirc;&#128;&#147; you&acirc;&#128;&#153;ve got the skills and 
know-how, I&acirc;&#128;&#153;ve got connections that can get us to all the worlds hot-spots.&acirc;&#128;&#157; He then added 
suavely, &acirc;&#128;&#156;Of course, the both of us could have a little fun together. So&acirc;&#128;&brvbar; what do you say?&acirc;&#128;&#157;

&acirc;&#128;&#156;Let me&acirc;&#128;&brvbar; think about it,&acirc;&#128;&#157; Moria replied as she pulled away. For the better part of five 
seconds she was silent, her back to the mercenary. Then she turned around and faced him. 
&acirc;&#128;&#156;I&acirc;&#128;&#153;ve got a better idea,&acirc;&#128;&#157; she finally said, an edge to her voice. &acirc;&#128;&#156;I turn you over to my 
dear Rally,&acirc;&#128;&#157; Vic blanched hearing this, &acirc;&#128;&#156;whereas she is going to drain the very lifeblood 
from your miserable body&acirc;&#128;&brvbar; as payment for all the sins you&acirc;&#128;&#153;ve committed during your time on 
this world!&acirc;&#128;&#157;

Vic was silent as he, for the first time, saw Moria&acirc;&#128;&#153;s face clearly. She was angry, if the 
scowl on her face was any indication. She also seemed to be wearing her black cycling 
outfit, but his attention was to her right hand, which was clenched and trembling. &acirc;&#128;&#156;I knew 
it,&acirc;&#128;&#157; he was able to say finally. &acirc;&#128;&#156;That dyke vampire has you under her power! Look,&acirc;&#128;&#157; he 
added, reaching for her hand, &acirc;&#128;&#156;come with me. The further away we&acirc;&#128;&#153;re from her&acirc;&#128;&brvbar;&acirc;&#128;&#157;

SLAP!!!

Vic&acirc;&#128;&#153;s head snapped back hard from the force of Moria&acirc;&#128;&#153;s slap, the side of his face stinging &acirc;&#128;&#147; 
and it seemed that he felt that she broken a tooth. &acirc;&#128;&#156;Rally would never do such a horrible 
thing to me!&acirc;&#128;&#157; she snarled, her teeth clenched. &acirc;&#128;&#156;She respects me too much ever to do that, 
even when she was pursuing me and I cursed her because she was a vampire!!&acirc;&#128;&#157; But then an odd, 
smirking look came over her face. &acirc;&#128;&#156;Even if she could, though &acirc;&#128;&#147; I doubt she could accomplish 
it, the way I am.&acirc;&#128;&#157;

Vic had to spit-out the broken tooth in his mouth before replying, &acirc;&#128;&#156;The&acirc;&#128;&brvbar; the way that you 
are?&acirc;&#128;&#157;

&acirc;&#128;&#156;You know, it was too bad you were not present the night I was shot at Arisugawa&acirc;&#128;&#153;s Locket,&acirc;&#128;&#157; 
Moria further smirked, her eyes suddenly shifting to bluish-white, &acirc;&#128;&#156;otherwise you would 
understand the danger&acirc;&#128;&brvbar;&acirc;&#128;&#157; she shuttered as, for the first time, Moria allowed the 
transformation to happen, &acirc;&#128;&#156;you are in&acirc;&#128;&brvbar;&acirc;&#128;&#157; the fangs in her mouth lengthened as silver-gray fur 
began to sprout-out of her exposed skin, &acirc;&#128;&#156;&acirc;&#128;&brvbar;NOWWW!!!&acirc;&#128;&#157;

Moria then collapsed on all fours, embracing the changes coming over her body. From Vic&acirc;&#128;&#153;s 
perspective, he watched in horror as her clothes tore themselves to pieces. Clawed feet and 
hands became dog-like, as well as a tail sprouting from her behind. At the same time, 
Moria&acirc;&#128;&#153;s ears peaked and moved to the top of her head, her face also growing into a snout. 
Vic had to fight the urge to lose control of his bladder as he heard moans and cries become 
snarls and growls. By the time it was over &acirc;&#128;&#147; which covered over a minute and a half &acirc;&#128;&#147; Moria 
was completely transformed: what was once a human female was now a giant wolf &acirc;&#128;&#147; a wolf that 
snarled viciously at Vic, her fangs bared as well as her ears flattened back as the 
she-beast padded on all fours towards the mercenary.

Finally losing control of his bladder, Vic had to fight to prevent screaming &acirc;&#128;&#147; and was 
surprised as another set of growls caught his attention. Briefly, Moria turned her attention 
from him &acirc;&#128;&#147; and saw another giant wolf with reddish-brown fur walking besides her. &acirc;&#128;&#152;I must 
say, Moria,&acirc;&#128;&#153; came the voice of Kenneth in the she-wolf&acirc;&#128;&#153;s head, &acirc;&#128;&#152;you make a rather 
intimidating stand there, as well as looking impressive.&acirc;&#128;&#153;

&acirc;&#128;&#152;F-Father?&acirc;&#128;&#153; Moria was genuinely surprised. It seemed that the new wolf was her own father.

&acirc;&#128;&#152;Don&acirc;&#128;&#153;t worry, we can communicate in this form,&acirc;&#128;&#153; Kenneth added. &acirc;&#128;&#152;Now I wouldn&acirc;&#128;&#153;t be too 
distracted right now, so I say we deliver this cad to your lady love. I do believe she&acirc;&#128;&#153;s 
close by.&acirc;&#128;&#157;

&acirc;&#128;&#152;Y-yes,&acirc;&#128;&#153; Moria replied, turning her attention to Vic as she lunged, snapping her jaws at his 
urinated crotch. &acirc;&#128;&#152;I just hope Rally isn&acirc;&#128;&#153;t too alarmed at my appearance.&acirc;&#128;&#153;

&acirc;&#128;&#152;Don&acirc;&#128;&#153;t concern yourself with that right now,&acirc;&#128;&#153; Kenneth added, snapping at Vic to prevent him 
from escaping in another direction. &acirc;&#128;&#152;Just make sure this villain receives his just 
desserts!&acirc;&#128;&#153;

&acirc;&#128;&#156;I don&acirc;&#128;&#153;t get it!! I just don&acirc;&#128;&#153;t get it!!!&acirc;&#128;&#157; Vic managed to gasp as he ran into a sudden bank 
of fog, unusual for this time of year, seemed to envelope the three. &acirc;&#128;&#156;With all this noise, 
the Wild Geese would be all over this place!&acirc;&#128;&#157; He had to avoid Moria as she snapped at him 
from behind. &acirc;&#128;&#156;Where are they!?!?&acirc;&#128;&#157;

XXX

Indeed, with all the noise the three were making, one would think that the area would be 
crowding with the mercenary army all at once. But oddly, the Wild Geese were conducting 
their search on the other side of the estate grounds. Surveying this strangely futile 
search, Pip Bernadotte, the leader of the Wild Geese, could only smile, for he was one of 
the few who knew what really was going on.

&acirc;&#128;&#156;Captain Bernadotte!&acirc;&#128;&#157; another voice &acirc;&#128;&#147; Walter&acirc;&#128;&#153;s &acirc;&#128;&#147; called out. &acirc;&#128;&#156;I must have a word with you!&acirc;&#128;&#157;

Pip rolled his single eye. &acirc;&#128;&#156;Merde,&acirc;&#128;&#157; he sighed, &acirc;&#128;&#156;eet didn&acirc;&#128;&#153;t tall long for him to find out.&acirc;&#128;&#157; 
Straightening out his uniform, he walked over to the aged butler and said, &acirc;&#128;&#156;Oui? What ees 
eet you want to know, non?&acirc;&#128;&#157;

Walter looked somewhat outraged as he eyed the Frenchman. &acirc;&#128;&#156;I had the opportunity to examine 
what had happened and found quite a few inconsistencies in the security procedures used. 
First,&acirc;&#128;&#157; the butler began, &acirc;&#128;&#156;was the decision of not having two soldiers rather than one in 
the cell area, considering how dangerous this individual is. Also, our chaplain was not 
properly escorted while in his rounds was also inexcusable. But the worst oversight was that 
the combination of the key lock was not changed, despite procedure to the contrary. It was 
YOUR duty to do THAT part! So do you have an explanation for this?&acirc;&#128;&#157;

Before Pip could reply, Alucard seemed to melt out of the darkness. &acirc;&#128;&#156;Now calm yourself, 
Walter,&acirc;&#128;&#157; the No-Life King drolled. &acirc;&#128;&#156;After all, from my point of view, everything is going 
according to plan.&acirc;&#128;&#157;

&acirc;&#128;&#156;According to&acirc;&#128;&brvbar;Alucard, what are you saying?&acirc;&#128;&#157; an aghast Walter demanded.

&acirc;&#128;&#156;You, above all, should know that Sir Integra would never have allowed Vic to be executed &acirc;&#128;&#147; 
unless she had a valid reason to do so,&acirc;&#128;&#157; Alucard explained. &acirc;&#128;&#156;I merely approached Captain 
Bernadotte with an opportunity to give Sir Integra a justification to allow Rally Vincent to 
kill that cowardly bastard.&acirc;&#128;&#157;

&acirc;&#128;&#156;True, all true,&acirc;&#128;&#157; Pip added. &acirc;&#128;&#156;None of ze Geese knew I was planning zis, of course. I merely 
handed-out ze schedules &acirc;&#128;&#147; with a few&acirc;&#128;&brvbar; enhancements, of course.&acirc;&#128;&#157;

Walter just shook his head. &acirc;&#128;&#156;You&acirc;&#128;&brvbar; the both of you&acirc;&#128;&brvbar; are saying that this&acirc;&#128;&brvbar; conspiracy was just 
for Miss Vincent&acirc;&#128;&#153;s benefit?&acirc;&#128;&#157; Looking up at the darkened sky, the old butler just sighed. &acirc;&#128;&#156;I 
must say, I myself wanted the same thing also, so&acirc;&#128;&brvbar; I will not tell Sir Integra of this.&acirc;&#128;&#157; But 
he further grumbled, &acirc;&#128;&#156;But this is so&acirc;&#128;&brvbar; so&acirc;&#128;&brvbar;&acirc;&#128;&#157;

&acirc;&#128;&#156;Irritating, Walter?&acirc;&#128;&#157; Alucard offered.

&acirc;&#128;&#156;Yes, that,&acirc;&#128;&#157; sighed Walter as he walked away. &acirc;&#128;&#156;The things I do for this household&acirc;&#128;&brvbar;&acirc;&#128;&#157;

XXX

Vic had done everything humanly possible to avoid the two wolves harassing him. Moria would 
be snapping at his heals the left of him, while Kenneth worked the right, shepparding the 
fugitive mercenary to some unknown location. Then Vic remembered his gun, which he drew and 
aimed at the two wolves. To their credit, Moria and Kenneth stopped their attack, but 
continued to snarl at him.

&acirc;&#128;&#156;Yeah, go ahead and growl at me, you mutts!&acirc;&#128;&#157; Vic muttered. &acirc;&#128;&#156;I&acirc;&#128;&#153;m betting that blessed bullets 
are just about as effective as silver ones!&acirc;&#128;&#157; He then looked over at Moria, her fangs bared 
at him. &acirc;&#128;&#156;Y&acirc;&#128;&#153;know, we could&acirc;&#128;&#153;ve made beautiful music together,&acirc;&#128;&#157; he said fondly. &acirc;&#128;&#156;Too bad you 
ended up as defectives as those vampires!&acirc;&#128;&#157; The snarls Moria gave out increased in volume as 
Vic took aim&acirc;&#128;&brvbar;

But a shot rang-out from Vic&acirc;&#128;&#153;s right, and the merc was forced to drop the gun when he found 
his right trigger finger had been shot-off! Turning in the direction of the shot, he was 
horrified to see Rally, her CZ-75 smoking. &acirc;&#128;&#156;That was for the stake in the heart, asshole!&acirc;&#128;&#157; 
the dusky vampire growled. In a panic, Vic tried to run, but soon found himself in Rally&acirc;&#128;&#153;s 
grasp. &acirc;&#128;&#156;Hate to say this, but it looks like you&acirc;&#128;&#153;re finally out of luck!&acirc;&#128;&#157; Then Vic had the 
misfortune of seeing the expression on Rally&acirc;&#128;&#153;s face &acirc;&#128;&#147; a predatory grin punctuated with a 
wild look in her eyes. The merc tried to pull away &acirc;&#128;&#147; only to have the fangs of the vampire 
plunging into his neck!

For the better part of two minutes Rally fed, taking her time like she did when she killed 
Goldie Muso, the fear in Vic&acirc;&#128;&#153;s heart making the blood all the sweeter. Vic&acirc;&#128;&#153;s movements, once 
frantic, began to grow more and more feeble as he died slowly. Then with a grand flourish, 
Rally used her teeth to rip Vic&acirc;&#128;&#153;s head from its shoulders as she felt his blood energizing 
and invigorating her. The look on her face was a mixture of ecstasy and satisfaction.

Coming down from her high, Rally was able to drop Vic&acirc;&#128;&#153;s headless body to the ground &acirc;&#128;&#147; and 
was shocked at seeing the two wolves standing in front of her. &acirc;&#128;&#156;Moria&acirc;&#128;&brvbar;&acirc;&#128;&#157; she whispered, 
recognizing the silver-gray one&acirc;&#128;&brvbar; and was relieved to see her lover&acirc;&#128;&#153;s ears perking up, as 
well as Moria&acirc;&#128;&#153;s tail wagging.

&acirc;&#128;&#152;I wouldn&acirc;&#128;&#153;t worry too much, my lovely,&acirc;&#128;&#153; Moria telepathically told Rally. &acirc;&#128;&#152;Besides, after 
getting over the initial shock, I figured that I might experience this form.&acirc;&#128;&#153; She padded 
over to the dusky vampire, who knelt-down and embraced the she-wolf. &acirc;&#128;&#152;After all, Father said 
I looked very good as a wolf. I hope you feel the same way!&acirc;&#128;&#153;

&acirc;&#128;&#156;You look majestic, Moria,&acirc;&#128;&#157; Rally whispered, who then got her face licked by the wolf. &acirc;&#128;&#156;Now 
take it easy,&acirc;&#128;&#157; she laughed, &acirc;&#128;&#156;we still got to explain this to Sir Integra!&acirc;&#128;&#157;

&acirc;&#128;&#152;Right. Let&acirc;&#128;&#153;s do just that.&acirc;&#128;&#153; Moria then walked besides Rally, her head high. &acirc;&#128;&#152;Father, are 
you coming?&acirc;&#128;&#153;

&acirc;&#128;&#152;Right behind you, Moria.&acirc;&#128;&#153; The reddish-brown wolf then followed Rally and Moria back to the 
mansion.

XXX

To be certain, many in front of the mansion were a bit shocked when they saw Rally walking 
back accompanied by two wolves. Sir Integra was particularly shocked to see Moria in the 
form of a wolf. Moria noticed this and asked the dusky vampire, &acirc;&#128;&#152;Rally, I need to explain my 
motivations to Sir Integra. Could you act as a telepathic bridge so I can do just that?&acirc;&#128;&#153;

&acirc;&#128;&#152;Yes, I can.&acirc;&#128;&#153; Just as the Hellsing leader was about to open her mouth, Rally held-up her 
hand. &acirc;&#128;&#156;Before you say anything, Integra, Moria would like to have a word with you.&acirc;&#128;&#157;

&acirc;&#128;&#156;She would? Rally, how can Moria do that in that form?&acirc;&#128;&#157; Sir Integra asked.

Rally didn&acirc;&#128;&#153;t answer, instead clearing her mind and allowing Moria to communicate through 
her. &acirc;&#128;&#152;Sir Integra,&acirc;&#128;&#153; the she-wolf began, startling the Hellsing leader, &acirc;&#128;&#152;please forgive me 
for taking this form, but I felt it was necessary in order to aid Rally in hunting down Vic. 
I know all of you were hoping it wouldn&acirc;&#128;&#153;t come to this, but in the last few days I have been 
thinking over my circumstances upon finding out about my werewolf heritage. I decided that, 
despite all of this, I should embrace my own uniqueness. Besides,&acirc;&#128;&#153; she added, wagging her 
tail, &acirc;&#128;&#152;I&acirc;&#128;&#153;ve gotten positive assessments on this form by both Father and Rally.&acirc;&#128;&#153;

Sir Integra smiled. &acirc;&#128;&#156;You do have a certain&acirc;&#128;&brvbar; majestic quality in that form, Moria. However, 
you do realize you will have to remain in that wolf form until sunrise.&acirc;&#128;&#157;

&acirc;&#128;&#152;Indeed I do,&acirc;&#128;&#153; Moria replied, &acirc;&#128;&#152;but I do not mind it at all!&acirc;&#128;&#153; Looking over at her father, she 
returned her attention to the dusky blonde. &acirc;&#128;&#152;Sir Integra, if you do not mind, me and Father 
would like to retire to the heliport.&acirc;&#128;&#153;

&acirc;&#128;&#156;I believe I know why you would ask that,&acirc;&#128;&#157; replied Sir Integra. &acirc;&#128;&#156;Very well, you have my 
permission.&acirc;&#128;&#157;

&acirc;&#128;&#152;Thank you, Sir Integra. Father, could you follow me?&acirc;&#128;&#153; Moria and Kenneth then made their way 
into the mansion, passing the Wild Geese at the doors. Despite knowing who they really are, 
some of the soldiers still looked upon them warily, their old prejudices about wolves still 
strong.

As soon as they were gone, Rally turned to Sir Integra. &acirc;&#128;&#156;Just wanted to let you know that 
Vic is dead, near the motor pool. I made sure he wouldn&acirc;&#128;&#153;t rise as a ghoul.&acirc;&#128;&#157;

&acirc;&#128;&#156;Very well,&acirc;&#128;&#157; Sir Integra said, returning to the mansion, &acirc;&#128;&#156;I will have Walter order the 
soldiers to have the body removed and incinerated. As for myself, I must make the final 
preparations for our trip to Silverstone Circuit tomorrow. We still have a job to do! Make 
sure you and your master are ready to set-out!&acirc;&#128;&#157;

&acirc;&#128;&#156;I will, Sir Integra,&acirc;&#128;&#157; Rally answered, &acirc;&#128;&#156;just as soon as I make a&acirc;&#128;&brvbar; little side trip.&acirc;&#128;&#157;

&acirc;&#128;&#156;Just make sure it is a short one, Rally,&acirc;&#128;&#157; Sir Integra replied, disappearing inside.

XXX

The two wolves soon found themselves on the rooftop heliport, with Moria walking up to the 
edge, staring at the full moon. Almost breathlessly, Moria looked up. &acirc;&#128;&#152;The day you called,&acirc;&#128;&#153; 
she began to her father, &acirc;&#128;&#152;I had this dream about turning into a wolf. I was terrified about 
the dream, and about becoming a wolf. But now, looking at the full moon, I feel so&acirc;&#128;&brvbar; excited, 
like my heart is about to leap from my chest!&acirc;&#128;&#153;

&acirc;&#128;&#152;We all feel that way about the moon, Moria dear,&acirc;&#128;&#153; Kenneth said, walking next to her. &acirc;&#128;&#152;I 
know what you&acirc;&#128;&#153;re thinking. Go on&acirc;&#128;&brvbar; do what your heart is saying right now!&acirc;&#128;&#153;

And then, Moria threw back her head and howled, with Kenneth accompanying her. It would be 
many days afterwards that neighbors of the Hellsings would remember hearing wolves howl at 
the moon&acirc;&#128;&brvbar; and how they trembled in fear because of it. But for those of the estate who knew 
better, the howling was anything but malevolent &acirc;&#128;&#147; but rather of fellowship with the night&acirc;&#128;&brvbar; 
something Alucard felt watching the two. &acirc;&#128;&#156;Such beautiful music,&acirc;&#128;&#157; he said, smiling.

&acirc;&#128;&#156;You can say that again,&acirc;&#128;&#157; Bean added, joining the No-Life King on the roof.

Alucard turned, genuinely surprised at Bean&acirc;&#128;&#153;s acceptance. &acirc;&#128;&#156;I would&acirc;&#128;&#153;ve figured you would be 
trembling in your boots hearing wolves howl,&acirc;&#128;&#157; he drolled.

&acirc;&#128;&#156;Are you kidding?&acirc;&#128;&#157; Bean laughed. &acirc;&#128;&#156;I&acirc;&#128;&#153;ve heard coyotes howling in the southwest, and they were 
alright&acirc;&#128;&brvbar; but it&acirc;&#128;&#153;s nothing compared to this.&acirc;&#128;&#157;

&acirc;&#128;&#156;Nice to hear, Bean.&acirc;&#128;&#157; Both Alucard and Bean turned to see Rally and Seras behind them. &acirc;&#128;&#156;For 
me, I&acirc;&#128;&#153;m glad Moria was able to put all her fears about her new powers behind her.&acirc;&#128;&#157;

&acirc;&#128;&#156;Agreed,&acirc;&#128;&#157; the Draculina added, smiling. But then, Seras&acirc;&#128;&#153; smile faded. &acirc;&#128;&#156;However, there&acirc;&#128;&#153;s 
still the matter of the FREAK within the Royal Rockets car club to contend with.&acirc;&#128;&#157;

&acirc;&#128;&#156;Yeah. The Commonwealth International Automotive Exposition and Show will be tomorrow, so be 
better get ready if we&acirc;&#128;&#153;re going to be at Silverstone, Master,&acirc;&#128;&#157; Rally said glumly. &acirc;&#128;&#156;You still 
going to help us, Bean?&acirc;&#128;&#157;

&acirc;&#128;&#156;I&acirc;&#128;&#153;ll be with you two hundred percent, Rally!&acirc;&#128;&#157; the courier answered. &acirc;&#128;&#156;We&acirc;&#128;&#153;ll get that bastard 
who caused the M-5 wreck!&acirc;&#128;&#157;

Alucard didn&acirc;&#128;&#153;t say anything &acirc;&#128;&#147; he just smiled, anticipated the bloodbath when they find the 
FREAK.
</pre>
<p><a href="../hellsing/niteangel-ch30.html")>Onwards to Part 30</a></p><hr> 
 <p><a href="../hellsing/niteangel-index.html">Back to Night Angels Index</a> -
<a href="../hellsing/index.html">Back to Hellsing Shoujo-Ai Fanfiction</a></p>

</body>
</html>
